{
  "backend/main.mo": "Main actor for the ICP backend implementing user profile management and restaurant booking CRUD with role-based access control (admin/user permissions) and booking status transitions (pending/confirmed/rejected).",
  "backend/migration.mo": "Data migration module that converts legacy booking records (stored as a List without status) into the new Map-based structure with a default `#pending` status field.",
  "feature_evidence.json": "Feature evidence report linking three implemented features (booking submission fix, admin bookings fetch, confirm/reject actions) to their relevant source files and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated summary document describing the purpose and key details of each frontend source file for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes using OKLCH color values for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "SEO-optimized HTML shell with meta tags, Open Graph properties, canonical URL, and a JSON-LD Restaurant schema for Pind Pahadi Restaurant Delhi targeting Najafgarh search queries.",
  "frontend/src/App.tsx": "TanStack Router setup with a root route, a pathless site layout route wrapping five public pages with Header/Footer/MobileStickyBar/WhatsAppButton, and a standalone obscure-URL admin route without site chrome.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, quick navigation links, and contact details (address, phone, hours, directions) for Pind Pahadi Restaurant.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with logo, desktop nav links, a call button, and a collapsible mobile menu for Pind Pahadi Restaurant.",
  "frontend/src/components/MobileStickyBar.tsx": "Fixed bottom bar visible on mobile with three quick-action buttons: Call, Directions, and Book Table.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating display component that renders filled/empty stars based on a numeric rating prop with configurable size.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp chat button that opens a pre-filled WhatsApp message to the restaurant's number when clicked.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing it when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for booking operations: submitting, fetching all, confirming, rejecting, and deleting bookings via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file importing Poppins and Noto Sans Devanagari fonts, configuring Tailwind, and defining a Punjabi earthy color palette via CSS custom properties for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page for Pind Pahadi Restaurant, displaying the restaurant's story, core values (with icons), and a team section with staff names and roles.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with a multi-step auth flow (password + Internet Identity) that fetches all bookings and allows admins to confirm or reject individual bookings via mutation hooks.",
  "frontend/src/pages/Contact.tsx": "Contact and table-booking page that collects guest details, calculates a UPI deposit, handles Internet Identity login, and submits the booking with a payment screenshot to the backend.",
  "frontend/src/pages/Home.tsx": "Landing page showcasing the restaurant's hero banner, featured dishes, 'why choose us' highlights, customer testimonials, and quick-action links to call, book, or get directions.",
  "frontend/src/pages/Menu.tsx": "Interactive menu page with category filtering, a cart with quantity controls, and a WhatsApp order-sending feature, displaying all menu items across Starters, Main Course, Beverages, and Combos.",
  "frontend/src/pages/Reviews.tsx": "Displays a customer reviews page with a rating summary (4.8/5) and six hardcoded testimonial cards, each showing name, date, star rating, and review text.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL query parameters (supporting both regular and hash-based routing), persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand colors (brown, mustard, red, cream), fonts (Poppins, Noto Sans Devanagari), box shadows, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project state for the Pind Pahadi Restaurant table booking system, listing existing feature fixes (booking submission, admin dashboard fetching, confirm/reject actions) and one pending backend fix to correctly persist bookings in stable storage."
}