{
  "backend/main.mo": "Motoko actor implementing a restaurant booking system with submitBooking, getAllBookings (admin-only), and clearAllBookings (admin-only) functions, using access control authorization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (visual theme, header, hero section, etc.) to their corresponding source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference index for the project's frontend structure.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "SEO-optimized HTML entry point with meta tags, Open Graph tags, and JSON-LD Restaurant schema markup for Pind Pahadi Restaurant Delhi.",
  "frontend/src/App.tsx": "Main React app defining TanStack Router routes for five pages (Home, Menu, About, Reviews, Contact) wrapped in a Layout with Header, Footer, MobileStickyBar, and WhatsAppButton.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with brand info, quick navigation links, contact details (address, phone, hours), directions link, and dynamic copyright year.",
  "frontend/src/components/Header.tsx": "Sticky header with bilingual restaurant branding, desktop navigation links with active state highlighting, click-to-call phone button, and a collapsible mobile hamburger menu.",
  "frontend/src/components/MobileStickyBar.tsx": "A fixed bottom navigation bar for mobile devices with three actions: call, get directions, and book a table.",
  "frontend/src/components/StarRating.tsx": "A reusable star rating display component that renders filled/empty stars based on a numeric rating prop.",
  "frontend/src/components/WhatsAppButton.tsx": "A fixed floating WhatsApp button that opens a pre-filled WhatsApp chat for restaurant reservations.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an ICP backend actor, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useQueries.ts": "Exports a `useSubmitBooking` mutation hook that calls the backend actor's `submitBooking` method with reservation form data.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines CSS custom properties for a Punjabi earthy color palette in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "The About Us page displaying the restaurant's story, core values, and team members with supporting images and a call-to-action.",
  "frontend/src/pages/Contact.tsx": "The Contact/Book a Table page featuring a validated reservation form that submits via the `useSubmitBooking` hook, alongside contact info and an embedded Google Map.",
  "frontend/src/pages/Home.tsx": "Landing page for Pind Pahadi restaurant featuring a hero section, featured dishes, why-choose-us highlights, testimonials, and a Google Maps embed with contact/navigation links.",
  "frontend/src/pages/Menu.tsx": "Menu page displaying categorized food items (Starters, Main Course, Beverages, Combos) with tab-based filtering, item details, and a call-to-order button.",
  "frontend/src/pages/Reviews.tsx": "Customer reviews page showing a 4.8-star rating summary with a star distribution breakdown and detailed testimonial cards from individual customers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom brand color palette (brown, mustard, red, cream), custom fonts (Poppins, Noto Sans Devanagari), box shadows, animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Defines the full project state for Pind Pahadi Restaurant Delhi's multi-page website, including architecture notes, design system (colors, fonts, bilingual support), required images, and a detailed list of existing implemented features across all pages."
}