{
  "backend/main.mo": "Main ICP actor implementing user profile management and table booking CRUD with role-based access control (admin/user), including booking status transitions (pending/confirmed/rejected) and payment details.",
  "backend/migration.mo": "Data migration module that transforms old booking records (with a flat `deposit` field) into the new schema with a structured `paymentDetails` object containing advanceAmount, paymentMethod, upiDetails, and bankDetails.",
  "feature_evidence.json": "Feature evidence report listing three implemented features: fixing admin dashboard booking display, restoring the payment details section in the booking form, and adding a screenshot/download option after booking confirmation.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files, describing each component, page, hook, and config file's purpose and key changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes including background, foreground, card, chart, and sidebar color variables.",
  "frontend/index.html": "SEO-optimized HTML shell with Open Graph tags, canonical URL, and a JSON-LD Restaurant schema for Pind Pahadi Restaurant Delhi targeting Najafgarh search queries.",
  "frontend/src/App.tsx": "TanStack Router setup with a root route, a pathless site layout route wrapping public pages with Header/Footer/MobileStickyBar/WhatsAppButton, and a standalone obscure-URL admin route without site chrome.",
  "frontend/src/components/BookingConfirmation.tsx": "Displays a styled booking confirmation card with guest details, payment info, and a booking reference number, and supports printing/downloading the confirmation via a new browser window.",
  "frontend/src/components/Footer.tsx": "Site footer component showing the restaurant brand, quick navigation links, and contact details including address, phone, hours, and a Google Maps directions link.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with the restaurant logo, desktop nav links, a phone number, and a responsive mobile hamburger drawer menu.",
  "frontend/src/components/MobileStickyBar.tsx": "Fixed bottom bar visible on mobile/tablet with three quick-action buttons: Call, Directions (Google Maps), and Book Table.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating display component that renders filled or empty stars based on a numeric rating, with configurable size and max stars.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp chat button that opens a pre-filled WhatsApp message to the restaurant's number in a new tab.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and exposing login status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all booking-related backend operations: submitting, fetching, confirming, rejecting, and deleting bookings via the ICP actor.",
  "frontend/src/index.css": "Global CSS file that imports Poppins and Noto Sans Devanagari fonts, sets up Tailwind directives, and defines a Punjabi earthy color palette via CSS custom properties for both light and dark themes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutUs.tsx": "About Us page displaying the restaurant's story, core values (freshness, love, family, rating), and team members with a header banner and image section.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with a two-step auth gate (Internet Identity login + password) that displays all bookings and allows confirming, rejecting, or deleting them with expandable row details.",
  "frontend/src/pages/Contact.tsx": "Contact/booking page with a reservation form (guest details, date/time, payment info, screenshot upload) that submits to the backend via a mutation hook and shows a confirmation component on success.",
  "frontend/src/pages/Home.tsx": "Home landing page featuring a hero section, featured dishes carousel, 'why choose us' highlights, customer testimonials, and an embedded Google Maps location widget.",
  "frontend/src/pages/Menu.tsx": "Menu page with a filterable list of menu items across categories (Starters, Main Course, Beverages, Combos) and a shopping cart that generates a WhatsApp order message.",
  "frontend/src/pages/Reviews.tsx": "Displays a customer reviews page with a rating summary (4.8/5) and six hardcoded testimonial cards, each showing name, date, star rating, and review text.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand colors (brown, mustard, red, cream), fonts (Poppins, Devanagari), box shadows, animations, and plugin integrations (typography, container-queries, animate).",
  "project_state.json": "Tracks the project state for a restaurant booking app, listing three pending fix/feature requests: making table bookings appear in the admin dashboard, restoring the payment details section, and adding a booking confirmation screenshot feature."
}