{
  "backend/main.mo": "Motoko actor implementing a restaurant booking system with role-based access control; exposes submitBooking (users only), getAllBookings (admins only, sorted by date), and clearAllBookings (admins only).",
  "feature_evidence.json": "Feature evidence report confirming that the admin dashboard route was changed from '/admin' to '/pindpahadi-manage-2024' in App.tsx, with high confidence and linked to test REQ-18.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference index for the project's frontend structure.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS custom property tokens for light and dark themes using OKLCH color values, plus global border and background defaults.",
  "frontend/index.html": "SEO-optimized HTML entry point with full meta tags, Open Graph tags, and JSON-LD LocalBusiness/Restaurant schema markup for Pind Pahadi Restaurant Delhi.",
  "frontend/src/App.tsx": "Defines the TanStack Router tree with a pathless siteLayoutRoute wrapping five public pages (Header/Footer/chrome) and a standalone '/pindpahadi-manage-2024' admin route without site chrome.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with brand info, quick navigation links, contact details (address, phone, hours, directions), dynamic copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky site header with bilingual restaurant branding, desktop nav links with active-state highlighting, a clickable phone button, and a mobile hamburger drawer.",
  "frontend/src/components/MobileStickyBar.tsx": "Fixed bottom bar visible only on mobile (lg:hidden) providing three quick-action buttons: Call, Directions (Google Maps), and Book Table.",
  "frontend/src/components/StarRating.tsx": "Renders a row of star icons based on a numeric rating, supporting configurable max stars and three size variants (sm, md, lg).",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp button that opens a pre-filled WhatsApp chat link to the restaurant's number when clicked.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exports useSubmitBooking (mutation) and useGetAllBookings (query) hooks that call the ICP backend actor for booking operations via React Query.",
  "frontend/src/index.css": "Global stylesheet that imports Poppins and Noto Sans Devanagari fonts, configures Tailwind, and defines a Punjabi earthy CSS custom-property color palette for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "About Us page displaying the restaurant's origin story, core values, and team members with a decorative header and image section.",
  "frontend/src/pages/Admin.tsx": "Multi-step admin dashboard with a password gate, Internet Identity login, and a table view of all bookings fetched from the ICP backend.",
  "frontend/src/pages/Contact.tsx": "Contact and table-booking page with a validated reservation form that submits to the ICP backend, plus contact info and an embedded Google Maps iframe.",
  "frontend/src/pages/Home.tsx": "Landing page for Pind Pahadi restaurant featuring a hero section, featured dishes, why-choose-us highlights, testimonials, and a Google Maps embed with contact/navigation links.",
  "frontend/src/pages/Menu.tsx": "Menu page displaying categorized food items (Starters, Main Course, Beverages, Combos) with tab-based filtering, item details, and a call-to-order button.",
  "frontend/src/pages/Reviews.tsx": "Reviews page showing a 4.8-star rating summary with a star distribution breakdown and detailed customer testimonial cards.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters (supporting both standard and hash-based routing), persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand colors, fonts (Poppins, Noto Sans Devanagari), shadows, border radii, animations, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the full project state (version 7) for the Pind Pahadi Restaurant Delhi multi-page website, including architectural notes, existing features with IDs/versions, and known issues. Serves as the source of truth for all implemented and planned features across Home, Menu, About Us, Reviews, and Contact/Book Table pages."
}