{
  "backend/main.mo": "Main Motoko actor defining user profile management and table booking functionality with role-based access control (admin/user permissions) using a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—fixing backend canister connection errors and adding retry/loading-state logic to the booking form—to their relevant source files and test IDs.",
  "frontend-file-summaries.txt": "Pre-generated summary document describing each frontend source file's purpose, used as a reference for build planning and code navigation.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes using OKLCH color values for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "SEO-optimized HTML shell with meta tags, Open Graph properties, canonical URL, and a JSON-LD Restaurant schema for Pind Pahadi Restaurant Delhi targeting Najafgarh search queries.",
  "frontend/src/App.tsx": "TanStack Router setup with a root route, a pathless site-layout route wrapping five public pages with Header/Footer/MobileStickyBar/WhatsAppButton, and a standalone obscure-URL admin route without site chrome.",
  "frontend/src/components/Footer.tsx": "Site-wide footer component rendering brand info, quick navigation links, contact details with phone/address/hours, and a dynamic copyright year with caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop nav links, phone call button, and a collapsible mobile menu for the Pind Pahadi restaurant site.",
  "frontend/src/components/MobileStickyBar.tsx": "Fixed bottom bar visible on mobile with three quick-action buttons: call, get directions, and book a table.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating display component that renders filled/empty stars based on a numeric rating prop with configurable size.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp chat button that opens a pre-filled message to the restaurant's WhatsApp number in a new tab.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, reinitializing it when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout, and exposing identity and status to the component tree.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for submitting a table booking (with retry logic) and fetching all bookings from the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file importing Poppins and Devanagari fonts, configuring Tailwind, and defining a Punjabi earthy color palette via CSS custom properties for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "About Us page displaying the restaurant's origin story, core values, team members, and a call-to-action to book a table.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with a three-step flow (password gate, Internet Identity login, booking dashboard) that displays all bookings and allows clearing them via the backend actor.",
  "frontend/src/pages/Contact.tsx": "Contact/booking page with a reservation form that collects guest details and a UPI payment screenshot, then submits the booking to the backend; also shows restaurant location, phone, and map embed.",
  "frontend/src/pages/Home.tsx": "Landing page for Pind Pahadi Restaurant showcasing a hero section, featured dishes, 'why choose us' highlights, customer testimonials, and links to call, book, or get directions.",
  "frontend/src/pages/Menu.tsx": "Interactive menu page with category filtering and a cart system that lets users add/remove items and send their order via a pre-filled WhatsApp message.",
  "frontend/src/pages/Reviews.tsx": "Reviews page displaying a 4.8-star rating summary with a star-distribution breakdown and a list of six detailed customer testimonials with ratings and dates.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, brand color palette, border radii, box shadows, animations, and plugins for a restaurant frontend.",
  "project_state.json": "Project state metadata for 'Pind Pahadi Restaurant' tracking existing fix features related to backend canister connection errors on the booking form and retry logic improvements."
}