{
  "backend/main.mo": "Main Motoko actor implementing user profile management (get/save) and table booking (submit/list/clear) with role-based access control enforcing admin and user permissions.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: updating the public URL domain to 'caffein.xyz' and fixing cross-device table reservation failures, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's frontend components, pages, hooks, and configuration.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes using OKLCH color values, plus base body and border styles.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Open Graph tags, canonical link, and JSON-LD Restaurant schema all referencing the corrected domain 'pindpahadirestrurent.caffein.xyz'.",
  "frontend/src/App.tsx": "Defines the TanStack Router tree with a pathless site layout route (Header/Footer/MobileStickyBar/WhatsAppButton) wrapping five public pages, plus a standalone obscure admin route without site chrome.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, quick navigation links, contact details (address, phone, hours, directions), dynamic copyright year, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop nav links, phone CTA, and a collapsible mobile menu for the Pind Pahadi restaurant site.",
  "frontend/src/components/MobileStickyBar.tsx": "Fixed bottom bar visible on mobile with three quick-action buttons: Call, Directions (Google Maps), and Book Table.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating display component that renders filled/empty stars based on a numeric rating prop with configurable size.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp button that opens a pre-filled reservation message chat when clicked.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an ICP backend actor, using an authenticated identity when available and an anonymous actor otherwise, then invalidates dependent queries on actor change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flow, and persisted identity state.",
  "frontend/src/hooks/useQueries.ts": "Provides useSubmitBooking mutation and useGetAllBookings query hooks that interact with the ICP backend actor for booking operations.",
  "frontend/src/index.css": "Global stylesheet importing Poppins and Noto Sans Devanagari fonts, defining Tailwind base/component/utility layers, CSS custom properties for a Punjabi earthy color palette, and utility classes for hero overlays and text shadows.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutUs.tsx": "About Us page displaying the restaurant's origin story, core values, team members, and a CTA to book a table.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page with a three-step flow (password gate, Internet Identity login, booking dashboard) that displays all bookings in a table and shows total deposits collected.",
  "frontend/src/pages/Contact.tsx": "Contact/booking page with a form for name, phone, guests, date, time, special requests, and UPI payment screenshot upload, which submits a booking to the backend canister.",
  "frontend/src/pages/Home.tsx": "Landing page for Pind Pahadi restaurant featuring a hero section, featured dishes, 'why choose us' highlights, testimonials, and a Google Maps embed.",
  "frontend/src/pages/Menu.tsx": "Menu page displaying categorized food items (Starters, Main Course, Beverages, Combos) with tab-based filtering and a call-to-order button.",
  "frontend/src/pages/Reviews.tsx": "Reviews page showing a rating summary with star distribution and a list of six customer testimonials with ratings, dates, and detailed comments.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, OKLCH-based color tokens (including a brand palette), border radii, box shadows, and keyframe animations, with typography, container-queries, and animate plugins enabled.",
  "project_state.json": "Project state metadata for the Pind Pahadi Restaurant app, tracking existing features, known issues (cross-device table reservation failure), and pending action requests including a URL domain update and reservation bug fix."
}