{
  "backend/main.mo": "Main ICP actor defining user profile and booking management with role-based access control (admin/user), supporting CRUD operations on bookings with status transitions (pending/confirmed/rejected) and authorization checks via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing two implemented features: a WhatsApp share button on the booking confirmation screen (with screenshot capture), and a fix for the admin dashboard to reliably display and refresh bookings via React Query invalidation.",
  "frontend-file-summaries.txt": "A JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's frontend components, pages, hooks, and configuration files.",
  "frontend/index.css": "Base Tailwind CSS entry file defining CSS custom property tokens for light and dark themes using OKLCH color values for backgrounds, foregrounds, borders, charts, and sidebar elements.",
  "frontend/index.html": "SEO-optimized HTML entry point for Pind Pahadi Restaurant with meta tags, Open Graph properties, canonical URL, and a JSON-LD Restaurant schema including address, geo-coordinates, ratings, and menu link.",
  "frontend/src/App.tsx": "Defines the TanStack Router tree with a pathless site layout route (Header/Footer/MobileStickyBar/WhatsAppButton) wrapping five public pages, and a standalone obscure-URL admin route without site chrome.",
  "frontend/src/components/BookingConfirmation.tsx": "Booking confirmation card component that displays reservation details and provides a print/save action and a 'Send to WhatsApp' button that auto-downloads a screenshot and opens a pre-filled WhatsApp chat link.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, quick navigation links, and contact details (address, phone, hours, directions) for Pind Pahadi Restaurant.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with the restaurant brand, desktop nav links, phone number, and a responsive mobile hamburger drawer menu.",
  "frontend/src/components/MobileStickyBar.tsx": "Fixed bottom bar visible on mobile/tablet with three quick-action buttons: Call, Get Directions, and Book Table.",
  "frontend/src/components/StarRating.tsx": "Reusable star rating display component that renders filled/empty stars based on a numeric rating with configurable size and max stars.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp chat button that links to a pre-filled WhatsApp message for restaurant reservations or inquiries.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing it when the user's identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend data operations including fetching, submitting, confirming, rejecting, and deleting bookings, plus user profile management.",
  "frontend/src/index.css": "Global stylesheet importing Poppins and Noto Sans Devanagari fonts, defining Tailwind base/component/utility layers, and setting a Punjabi earthy CSS custom property color palette for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/AboutUs.tsx": "Renders the About Us page for Pind Pahadi Restaurant, displaying the restaurant's story, core values (with icons), and a team section with staff names and roles.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page requiring Internet Identity login and a hardcoded password, allowing admins to view, filter, confirm, reject, and delete table bookings.",
  "frontend/src/pages/Contact.tsx": "Contact/booking page with a form for table reservations including guest details, date/time selection, payment info, and screenshot upload, submitting data via a backend mutation.",
  "frontend/src/pages/Home.tsx": "Homepage featuring a hero section, featured dishes carousel, 'why choose us' highlights, customer testimonials, and an embedded Google Maps location for the restaurant.",
  "frontend/src/pages/Menu.tsx": "Interactive menu page displaying categorized food items with a shopping cart that tracks quantities and generates a WhatsApp order message with the selected items.",
  "frontend/src/pages/Reviews.tsx": "Displays a customer reviews page with a static list of six testimonials, an aggregate 4.8-star rating summary with per-star breakdown, and individual review cards showing name, date, rating, and detailed text.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL query parameters from both regular and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom brand color tokens (brown, mustard, red, cream), custom fonts (Poppins, Noto Sans Devanagari), box shadows, border radii, and keyframe animations, with typography, container-queries, and animate plugins enabled.",
  "project_state.json": "Tracks the project state for the Pind Pahadi Booking app, recording existing features (WhatsApp screenshot sharing on confirmation, admin dashboard fix), a pending new feature request to send booking details with a screenshot to WhatsApp, and a known issue with the broken admin dashboard connection."
}