{
  "kind": "build_request",
  "title": "Fix cross-device table reservation and update canonical URL",
  "projectName": "Pind Pahadi Restaurant",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update all references to the app's public URL from 'pindpahadirestrurent.caffeine.xyz' to 'pindpahadirestrurent.caffein.xyz' (note: single 'e' in 'caffein'). This includes the canonical URL meta tag in frontend/index.html, the Open Graph URL, the JSON-LD Restaurant schema URL, and any hardcoded domain references across the codebase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "change url to pindpahadirestrurent.caffein.xyz"
        ]
      },
      "acceptanceCriteria": [
        "The canonical URL in index.html points to https://pindpahadirestrurent.caffein.xyz",
        "Open Graph og:url meta tag uses the new domain",
        "JSON-LD Restaurant schema URL uses the new domain",
        "No remaining references to the old 'caffeine.xyz' domain exist in the frontend source files"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the table reservation (booking) feature so that it works correctly when accessed from any device, not just the device on which the booking was originally initiated. Investigate and resolve any issues in the booking submission flow in frontend/src/pages/Contact.tsx and frontend/src/hooks/useQueries.ts that could cause failures on other devices — such as device-specific actor initialization, anonymous identity mismatches, or session/actor not being properly set up for unauthenticated users on a fresh device.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-last"
        ],
        "quotes": [
          "there is problem in reserving table from other device pls correct this"
        ]
      },
      "acceptanceCriteria": [
        "A user on any device (mobile or desktop, any browser) can open the Contact/Book Table page and submit a reservation without errors",
        "The booking submission does not depend on any device-local session state or previously cached actor",
        "Submitted bookings from any device appear correctly in the admin dashboard",
        "The anonymous actor is correctly initialized for unauthenticated booking submissions on fresh devices",
        "Error messages, if any, are informative and actionable for the user"
      ]
    }
  ],
  "constraints": [
    "Do not change the admin route path or password",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Preserve all existing booking data in the backend"
  ],
  "nonGoals": [
    "Redesigning the reservation form UI",
    "Adding new reservation fields or features",
    "Changing the admin dashboard functionality",
    "Modifying the payment/UPI deposit flow"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}