{
  "kind": "build_request",
  "title": "Fix deployment and backend connection issues",
  "projectName": "Pind Pahadi Restaurant",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the backend canister connection so that the booking form on the Contact page successfully connects to the backend without showing 'Still connecting to the server. Please wait a moment and try again.' errors.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Still connecting to the server. Please wait a moment and try again.",
          "it no publish"
        ]
      },
      "acceptanceCriteria": [
        "The booking form on the Contact page loads without any connection error messages",
        "Submitting the booking form successfully sends data to the backend canister",
        "The backend actor initializes correctly on page load without requiring manual refresh"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add retry logic and a user-friendly loading state to the booking form so that if the backend canister takes a moment to warm up after deployment, the form gracefully retries the connection and shows a friendly loading indicator instead of an error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "The canister may still be warming up after the latest deployment"
        ]
      },
      "acceptanceCriteria": [
        "The booking form shows a loading spinner or 'Connecting...' message while the backend actor is initializing",
        "The form automatically retries connecting to the backend at least 3 times before showing an error",
        "Error messages are user-friendly and suggest refreshing if the connection ultimately fails"
      ]
    }
  ],
  "constraints": [
    "Do not change the existing booking form fields or UPI payment screenshot upload functionality",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/main.tsx",
    "Preserve all existing restaurant branding, color palette, and design"
  ],
  "nonGoals": [
    "Redesigning any pages or UI components",
    "Adding new features to the booking system",
    "Changing the admin dashboard functionality"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}