{
  "kind": "build_request",
  "title": "Fix admin dashboard bookings visibility, restore payment details, and add screenshot option",
  "projectName": "Pind Pahadi Admin",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the admin dashboard so that table bookings submitted by users appear correctly. Ensure that after a user submits a booking via the Contact/booking page, it is retrievable and displayed in the Admin dashboard booking list without requiring a manual refresh or re-login.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "not coming at admin dasboard"
        ]
      },
      "acceptanceCriteria": [
        "After a user submits a table booking, it appears in the admin dashboard booking list",
        "Admin can see all submitted bookings including name, date, time, party size, and contact info",
        "Bookings persist and are visible after admin logs out and back in"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore the payment details section in the booking form on the Contact page. The section should allow users to enter or view payment-related information (e.g., advance payment amount, payment method, UPI/bank details for the restaurant) as part of the table booking flow.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "why you remove payment details"
        ]
      },
      "acceptanceCriteria": [
        "Payment details section is visible in the booking form or booking confirmation flow",
        "Payment details submitted by the user are stored with the booking record",
        "Admin dashboard displays the payment details alongside each booking entry"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a screenshot/capture option in the booking confirmation flow. After a user successfully submits a booking, provide a button that allows them to take or download a screenshot of their booking confirmation details (booking ID, name, date, time, party size, payment info) as an image or printable view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "screenshot option add it"
        ]
      },
      "acceptanceCriteria": [
        "A 'Save / Screenshot' button is displayed on the booking confirmation screen after successful submission",
        "Clicking the button captures or downloads a formatted confirmation card showing booking details",
        "The confirmation card includes booking ID, guest name, date, time, party size, and payment details",
        "The feature works without any third-party external service"
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Keep all Motoko backend logic within the single actor in backend/main.mo",
    "Preserve existing admin authentication flow (Internet Identity + hardcoded password)"
  ],
  "nonGoals": [
    "Redesigning the overall visual theme or layout of the app",
    "Adding new payment gateway integrations (e.g., Stripe, Razorpay)",
    "Changing the admin authentication mechanism"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}