{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Change admin dashboard URL path to a custom less-obvious route",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Change the admin dashboard route from '/admin' to '/pindpahadi-manage-2024' and update all internal references",
      "acceptanceCriteria": [
        "Navigating to '/pindpahadi-manage-2024' loads the password-protected admin dashboard",
        "Navigating to '/admin' no longer loads the admin dashboard (404 or redirects to home)",
        "All internal links or programmatic navigations that previously pointed to '/admin' now point to '/pindpahadi-manage-2024'",
        "The new path does not appear in the main navigation header or mobile sticky bar"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the router configuration to change the admin route path from '/admin' to '/pindpahadi-manage-2024'. Modify the Route component definition for the admin dashboard to use the new path. Ensure the route remains standalone without the site layout wrapper (no Header/Footer/MobileStickyBar). Remove or update any route guards or redirects that reference '/admin'."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update any internal navigation logic, programmatic redirects, or hardcoded path references within the admin dashboard component that point to '/admin' to use '/pindpahadi-manage-2024' instead. Ensure success/failure flows and any redirect logic after password entry use the correct new path."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Review the desktop navigation links and mobile hamburger drawer menu. If any link to '/admin' exists (unlikely per current implementation), remove it or ensure it does not expose the new admin path '/pindpahadi-manage-2024'. Confirm the admin route remains hidden from all visible navigation."
        },
        {
          "path": "frontend/src/components/MobileStickyBar.tsx",
          "operation": "modify",
          "description": "Verify that the mobile sticky navigation bar does not include any link or reference to '/admin' or '/pindpahadi-manage-2024'. Ensure the new admin path remains unexposed in the mobile navigation UI."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Review the footer quick navigation links. If any link to '/admin' exists, remove it or ensure the new admin path '/pindpahadi-manage-2024' is not exposed in the footer navigation."
        }
      ]
    }
  ]
}