{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix cross-device table reservation and update canonical URL",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update all references to the app's public URL from 'pindpahadirestrurent.caffeine.xyz' to 'pindpahadirestrurent.caffein.xyz' (single 'e' in 'caffein')",
      "acceptanceCriteria": [
        "The canonical URL in index.html points to https://pindpahadirestrurent.caffein.xyz",
        "Open Graph og:url meta tag uses the new domain",
        "JSON-LD Restaurant schema URL uses the new domain",
        "No remaining references to the old 'caffeine.xyz' domain exist in the frontend source files"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the canonical link href from 'https://pindpahadirestrurent.caffeine.xyz/' to 'https://pindpahadirestrurent.caffein.xyz/'. Update the Open Graph og:url meta tag property content to use the new domain. Update the JSON-LD Restaurant schema's url field to 'https://pindpahadirestrurent.caffein.xyz'. Verify all three locations are updated with the corrected domain spelling (single 'e' in 'caffein')."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update any hardcoded domain references from 'pindpahadirestrurent.caffeine.xyz' to 'pindpahadirestrurent.caffein.xyz' if present in the footer attribution link or other footer content."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix the table reservation feature to work correctly from any device by ensuring anonymous actor initialization is device-independent",
      "acceptanceCriteria": [
        "A user on any device (mobile or desktop, any browser) can open the Contact/Book Table page and submit a reservation without errors",
        "The booking submission does not depend on any device-local session state or previously cached actor",
        "Submitted bookings from any device appear correctly in the admin dashboard",
        "The anonymous actor is correctly initialized for unauthenticated booking submissions on fresh devices",
        "Error messages, if any, are informative and actionable for the user"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Review the booking form submission flow to ensure it properly handles cases where the actor may not be immediately available on fresh devices. Add defensive checks for actor availability before calling submitBooking. Ensure the form validation and error states provide clear feedback if the backend connection fails. Add loading states during actor initialization if needed. Verify that the screenshot upload and all form fields work correctly across devices without relying on device-specific cached state."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the useSubmitBooking mutation hook to ensure it properly waits for the actor to be available before attempting to call submitBooking. Add error handling that distinguishes between actor initialization failures and booking submission failures. Ensure the mutation does not depend on any device-local state or cached identity that may not exist on a fresh device. Verify the enabled condition properly reflects actor availability. Add retry logic if appropriate for transient connection issues."
        }
      ]
    }
  ]
}