{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix booking submissions not appearing in admin dashboard",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Fix the booking submission mutation to correctly call the backend actor method and surface errors to the user",
      "acceptanceCriteria": [
        "Submitting the booking form on the Contact/booking page invokes the backend actor's booking submission method without throwing or silently failing.",
        "If the submission fails, an error message is displayed to the user on the form.",
        "On successful submission, the user sees a success confirmation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useSubmitBooking mutation to call actor.submitBooking with the correct arguments (name, phone, guests as bigint, date, time, specialRequest, screenshotFileName as string | null). Ensure the mutation properly handles success/failure responses and returns them to the caller. Remove any silent error swallowing and allow errors to propagate to the UI layer."
        },
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Update the booking form submission handler to use the fixed useSubmitBooking mutation, display error messages to the user when submission fails (using the mutation's error state), and show a success confirmation message when submission succeeds. Ensure the form properly converts the guests input to a bigint before passing it to the mutation."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix the bookings query and Admin dashboard to correctly fetch and display all bookings with proper authentication",
      "acceptanceCriteria": [
        "After logging into the admin dashboard, all submitted bookings are fetched and listed in the 'All Reservations' table.",
        "The 'Total Bookings', 'Total Guests', 'Total Deposits', and 'Today' summary counters reflect actual data from fetched bookings.",
        "Clicking the Refresh button re-fetches bookings from the backend and updates the list.",
        "The empty state ('No reservations yet') is only shown when there are genuinely zero bookings stored."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Fix the useGetBookings query to call actor.getAllBookings() (not getBookings) using an authenticated actor. Ensure the query is enabled only when the actor is available and uses the correct queryKey ['bookings']. Add proper error handling and typing for the returned Booking array with status field."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the Admin dashboard to use the fixed useGetBookings query with proper authentication checks. Wire the Refresh button to invalidate the 'bookings' query key and trigger a refetch. Update the summary counters (Total Bookings, Total Guests, Total Deposits, Today) to calculate from the fetched bookings array. Ensure the empty state only displays when bookings.length === 0. Add authorization checks using the authorization component to verify the user is an admin before showing the dashboard."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add Confirm and Reject action buttons to each booking row with status badges",
      "acceptanceCriteria": [
        "Each booking row in the admin dashboard displays a status badge (Pending, Confirmed, or Rejected).",
        "An admin can click 'Confirm' on a pending booking to mark it as confirmed; the status updates in the UI immediately.",
        "An admin can click 'Reject' on a pending booking to mark it as rejected; the status updates in the UI immediately.",
        "The backend stores and returns the booking status correctly.",
        "Already-confirmed or already-rejected bookings show disabled or appropriately changed action buttons."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useConfirmBooking and useRejectBooking mutations that call actor.confirmBooking(id) and actor.rejectBooking(id) respectively. Both mutations should invalidate the 'bookings' query on success to trigger a refetch and update the UI. Include proper error handling and success callbacks."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Update the bookings table to display a status badge for each booking showing 'Pending', 'Confirmed', or 'Rejected' based on booking.status. Add 'Confirm' and 'Reject' action buttons to each row that call the useConfirmBooking and useRejectBooking mutations respectively. Disable or hide the action buttons for bookings that are already confirmed or rejected. Ensure the booking ID is correctly passed to the mutations (bookings must be returned with IDs from the backend or tracked by index)."
        }
      ]
    }
  ]
}