{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Send booking confirmation details with screenshot to WhatsApp on confirm",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add 'Send to WhatsApp' button to BookingConfirmation that captures a screenshot, downloads it, and opens WhatsApp with pre-filled booking details",
      "acceptanceCriteria": [
        "A 'Send to WhatsApp' button is visible on the BookingConfirmation component after a booking is submitted successfully.",
        "Clicking the button triggers a screenshot capture of the confirmation card and automatically downloads it as a PNG file.",
        "A WhatsApp chat window opens with a pre-filled message containing: booking reference, guest name, date, time, party size, and payment details.",
        "The pre-filled WhatsApp message includes a note prompting the user to attach the downloaded screenshot.",
        "The WhatsApp number used matches the restaurant's existing contact number already used in WhatsAppButton.tsx."
      ],
      "file_operations": [
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "Add html2canvas library as a dependency to enable client-side screenshot capture of the booking confirmation card."
        },
        {
          "path": "frontend/src/components/BookingConfirmation.tsx",
          "operation": "modify",
          "description": "Add a 'Send to WhatsApp' button below the existing action buttons. Implement a click handler that: (1) uses html2canvas to capture a screenshot of the confirmation card element, (2) converts the canvas to a blob and triggers a browser download as 'booking-confirmation-<reference>.png', (3) extracts booking details (reference, name, date, time, guests, payment method, advance amount) from props, (4) constructs a WhatsApp message text with all booking details and a reminder to attach the downloaded screenshot, (5) opens a new window/tab to wa.me/<phone-number> with the pre-filled text parameter. Use the same phone number constant that WhatsAppButton.tsx uses. Handle loading states during screenshot generation and provide user feedback."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix admin dashboard bookings list by ensuring React Query invalidation after booking mutations and proper query setup in Admin page",
      "acceptanceCriteria": [
        "After a user submits a booking via the Contact page, it appears in the Admin dashboard bookings list without requiring a manual page reload.",
        "After an admin confirms, rejects, or deletes a booking, the list updates to reflect the change immediately.",
        "The Admin page displays all bookings stored in the backend with correct status labels (pending/confirmed/rejected).",
        "No stale or empty booking list is shown when valid bookings exist in the backend."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useSubmitBooking mutation hook to ensure it calls queryClient.invalidateQueries with the correct query key for the bookings list after a successful submission. Similarly, ensure useConfirmBooking, useRejectBooking, and useDeleteBooking mutation hooks all invalidate the ['bookings'] query key (or whatever key is used by the getAllBookings query) in their onSuccess callbacks. Verify that the query key used for invalidation matches the key used by the fetch query hook exactly."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Verify that the Admin page correctly calls the React Query hook that fetches all bookings (e.g., useGetAllBookings or equivalent from useQueries.ts). Ensure the query is enabled and not blocked by any conditional logic. Confirm that the bookings data returned by the query is properly rendered in the table, including correct mapping of booking status values. Add error handling to display a message if the query fails. Ensure the page shows a loading state while the query is fetching and handles empty states appropriately."
        },
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Review the booking form submission flow to ensure that after a successful booking submission, the component either triggers a manual refetch of the bookings query or relies on the mutation's onSuccess invalidation. Verify that the success state properly reflects the submitted booking and that no stale data is cached client-side that would prevent the admin dashboard from showing the new booking."
        }
      ]
    }
  ]
}