{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin dashboard bookings visibility, restore payment details, and add screenshot option",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix admin dashboard so table bookings submitted by users appear correctly without requiring manual refresh or re-login",
      "acceptanceCriteria": [
        "After a user submits a table booking, it appears in the admin dashboard booking list",
        "Admin can see all submitted bookings including name, date, time, party size, and contact info",
        "Bookings persist and are visible after admin logs out and back in"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add automatic query invalidation after booking submission to ensure the admin bookings list refreshes immediately. Configure React Query to invalidate the 'bookings' query key when submitBooking mutation succeeds, ensuring real-time visibility of new bookings in the admin dashboard."
        },
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Update the booking submission flow to trigger query invalidation after successful submission. Ensure the form uses the updated useSubmitBooking hook that properly invalidates cached booking data, making new bookings immediately visible in the admin dashboard."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Ensure the admin dashboard properly displays all booking fields including name, date, time, party size (guests), phone, and special requests. Verify the booking list uses the getAllBookings query and properly handles real-time updates when new bookings are submitted. Add loading and error states for better UX."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore payment details section in the booking form on the Contact page, allowing users to view payment information as part of the table booking flow",
      "acceptanceCriteria": [
        "Payment details section is visible in the booking form or booking confirmation flow",
        "Payment details submitted by the user are stored with the booking record",
        "Admin dashboard displays the payment details alongside each booking entry"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Add a payment details section to the booking form displaying the restaurant's payment information (UPI details, bank details, advance payment amount, and accepted payment methods). Wire the PaymentDetails data from the backend interface into the form, collecting any user-provided payment information and passing it to the submitBooking backend capability. The section should be clearly labeled and positioned after the booking details but before the submit button."
        },
        {
          "path": "frontend/src/pages/Admin.tsx",
          "operation": "modify",
          "description": "Display payment details for each booking in the admin dashboard. Show the advance amount, payment method, UPI details, and bank details alongside existing booking information (name, date, time, guests, phone). Format the payment information in a readable way, possibly in an expandable section or modal for each booking row."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add screenshot/capture option in the booking confirmation flow allowing users to download a formatted confirmation card",
      "acceptanceCriteria": [
        "A 'Save / Screenshot' button is displayed on the booking confirmation screen after successful submission",
        "Clicking the button captures or downloads a formatted confirmation card showing booking details",
        "The confirmation card includes booking ID, guest name, date, time, party size, and payment details",
        "The feature works without any third-party external service"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Contact.tsx",
          "operation": "modify",
          "description": "Add a booking confirmation view that appears after successful submission, displaying all booking details (booking ID/timestamp, guest name, date, time, party size, phone, special requests, and payment details) in a formatted confirmation card. Include a 'Download Confirmation' button that uses the html2canvas library (or browser-native screenshot APIs) to capture the confirmation card as an image and trigger a download. The confirmation card should be styled as a standalone receipt/ticket with clear typography and the restaurant's branding."
        },
        {
          "path": "frontend/src/components/BookingConfirmation.tsx",
          "operation": "create",
          "description": "Create a new BookingConfirmation component that renders a printable/downloadable confirmation card with all booking details. Include props for booking data (name, date, time, guests, phone, special requests, payment details) and a unique booking reference. Style the component as a standalone ticket/receipt with clear sections, the restaurant logo/name, and QR code or reference number. Export a captureConfirmation helper function that uses html2canvas to convert the rendered component to an image blob and trigger download."
        }
      ]
    }
  ]
}